from math import acos, sqrt, tan
from output import Output

o = Output(globals())
o.add_pretty_names({
  "tanf_A":"tan%varphi_A",
  "tanf_cp":"tan%varphi_cp",
  "cosf_ПС1в":"cos%varphi_ПС1в",
  "cosf_ПС1н":"cos%varphi_ПС1н",
  "cosf_ПС2н": "cos%varphi_ПС2",
  "cosf_A":   "cos%varphi_A",
  "sumP_H":"P_{%SIGMA H}",
  "sumS_H":"S_{%SIGMA H}",
  "sumQ_H":"Q_{%SIGMA H}",
  "DP_sum":"{%DELTA P_{%SIGMA}}",
  "DQ_T":"{%DELTA Q}_T",
  "sumQ_КП__needed":"Q_{КП%SIGMA}^needed",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
  "":"",
})
##@#skip begin
OBJ_POS = [(1,3),(4,5),(6,1)]
U_ПС1в = 110 #@# !кВ
U_ПС1н = 10  #@# !кВ
U_ПС2н  = 10  #@# !кВ

P_ПС1в = 86  #@# !МВт
P_ПС1н = 30  #@# !МВт
P_ПС2н  = 130 #@# !МВт

cosf_ПС1в = 0.88 #@#
cosf_ПС1н = 0.83 #@#
cosf_ПС2н  = 0.82 #@#

K_ПС1I  = 40 #@# !%
K_ПС1II = 60 #@# !%
K_ПС2I  = 55 #@# !%
K_ПС2II = 45 #@# !%

T_нб = 4200 #@# !год

cosf_A = 0.89 #@# 
#@#skip end
"1.1. Розрахунок балансу активних потужностей"#@#h !2

"Сумарна активна потужність:"#@#p
sumP_H = P_ПС1в+P_ПС1н+P_ПС2н #@# !МВт

"Сумарні втрати активної потужності:"#@#p
DP_sum   = 0.06 * sumP_H #@# !МВт

k_нп = 0.95

"Найбільша сумарна активна потужність, що споживається мережею"#@#p
P_СП  = k_нп * sumP_H + DP_sum          #@# !МВт
k_paragraph = f"де $k_нп$ – коефіцієнт, який враховує неспівпадіння в часі максимальних навантажень споживачів, приймаємо $k_нп$ = {o.parser.fmt(k_нп,2)}"
k_paragraph#@#p
"1.2. Розрахунок балансу реактивних потужностей"#@#h !2
k = 1
"Реактивна потужність навантаження кожної підстанції"#@#p
Q_ПС1в = P_ПС1в * tan(acos(cosf_ПС1в) ) #@# !Мвар
Q_ПС1н = P_ПС1н * tan(acos(cosf_ПС1н) ) #@# !Мвар
Q_ПС2н  = P_ПС2н * tan(acos(cosf_ПС2н) )   #@# !Мвар

"Сумарна реактивна потужність навантаження:"#@#p
sumQ_H = Q_ПС1в+Q_ПС1н+Q_ПС2н                  #@# !Мвар

"Сумарна повна потужність навантаження споживачів:"#@#p
sumS_H = sqrt(sumP_H**2 + sumQ_H**2)    #@# !МВА

"Втрати рекативної потужності в трансформаторах:"#@#p
DQ_T = 0.1 * k * sumS_H #@# !Мвар

"Найбільша реактивна потужність, що споживається в районній мережі:"#@#p
Q_СП = k_нп * sumQ_H + DQ_T #@# !Мвар

"Генерована реактивна потужність:"#@#p
Q_Г   = P_СП * tan(acos(cosf_A) )     #@# !Мвар
assert Q_СП > Q_Г

"1.3. Вибір потужності та розміщення компенсувальних пристроїв"#@#h !2
Q_balance_message = f"Оскільки $Q_СП = {o.parser.fmt(Q_СП,3)} Мвар > Q_Г = {o.parser.fmt(Q_Г,3)} Мвар$, потрібно передбачити встановлення компенсувальних пристроїв, потужність, яких визначають із рівняння балансу реактивної потужності"
Q_balance_message#@#p

"$Q_Г + Q_КП = Q_СП$"#@#p
Q_КП = Q_СП - Q_Г #@# !Мвар

"Середній коефіцієнт реактивної потужності:"#@#p
tanf_cp = (sumQ_H - Q_КП) / sumP_H #@#

"Вибір комплектних конденсаторних установок"#@#p
Q_КП1в = Q_ПС1в - P_ПС1в*tanf_cp #@# !Мвар
Q_КП1н = Q_ПС1н - P_ПС1н*tanf_cp #@# !Мвар
Q_КП2н = Q_ПС2н - P_ПС2н*tanf_cp #@# !Мвар

"Повна потужність навантаження підстанцій з врахуванням встановленої потужності КП:"#@#p
S_ПС1в = complex(P_ПС1в, Q_ПС1в - Q_КП1в) #@# !МВА @cplxstyle:0 $nonumbers
S_ПС1н = complex(P_ПС1н, Q_ПС1н - Q_КП1н) #@# !МВА $nonumbers
S_ПС2  = complex(P_ПС2н, Q_ПС2н - Q_КП2н)  #@# !МВА $nonumbers

"Повні потужності на підстанціях після компенсації:"#@#p
S_1 = S_ПС1в + S_ПС1н #@# !МВА @cplxstyle:-1
S_2 = S_ПС2 #@# !МВА 

"2. ПРОЕКТУВАННЯ СХЕМИ РАЙОННОЇ МЕРЕЖІ"#@#h !1
"2.1. Розроблення варіантів схеми мережі"#@#h !2
"Намічаємо можливі варіанти електромережі:"#@#p

"Розрахуємо довжини ліній"#@#h !3
m = 11
m_paragraph = f"Оскільки масштаб 1см:{m}км, то:"
m_paragraph#@#p

l_A1 = sqrt(2**2 + 3**2) * m #@# !км $onlynumbers
l_A2 = sqrt(2**2 + 4**2) * m #@# !км $onlynumbers
l_12 = sqrt(1**2 + 4**2) * m #@# !км $onlynumbers

"Оцінюємо попередній потокорозподіл потужностей в цих варіантах мереж."#@#p

"Кільцева мережа:"#@#p
S_A1cir = (S_1 * (l_12 + l_A2) + S_2 * l_A2)/(l_A1+l_A2+l_12) #@# !МВА @cplxstyle:-1
S_A2cir = (S_2 * (l_12 + l_A1) + S_1 * l_A1) / (l_A1+l_A2+l_12) #@# !МВА
S_12cir = S_A1cir - S_1  #@# !МВА

"Магістральна мережа:"#@#p
S_A1mag = (S_1 + S_2) / 2 #@# !МВА
S_12mag = S_2/2 #@# !МВА

"Радіальна мережа (розрахунок виконується для одного кола двоколової ЛЕП, тому потужність поділена навпіл):"#@#p
S_A1rad = S_1/2 #@# !МВА
S_A2rad = S_2/2 #@# !МВА

"2.2. Вибір номінальної напруги мережі"#@#h !2
"Для визначення номінальної напруги мережі використовуємо емпіричну формулу Ілларіонова"#@#p
P_A1cir = S_A1cir.real
P_A2cir = S_A2cir.real
P_12cir = S_12cir.real
P_A1mag = S_A1mag.real
P_12mag = S_12mag.real
P_A1rad = S_A1rad.real
P_A2rad = S_A2rad.real

"Кільцева мережа:"#@#p
U_A1__cir = 1000 / sqrt(500/l_A1 + 2500/P_A1cir) #@# !кВ
U_A2__cir = 1000 / sqrt(500/l_A2 + 2500/P_A2cir) #@# !кВ
U_12__cir = 1000 / sqrt(500/l_12 + 2500/P_12cir) #@# !кВ

"Магістральна мережа:"#@#p
U_A1__mag = 1000 / sqrt(500/l_A1 + 2500/P_A1mag) #@# !кВ
U_12__mag = 1000 / sqrt(500/l_12 + 2500/P_12mag) #@# !кВ

"Радіальна мережа:"#@#p
U_A1__rad = 1000 / sqrt(500/l_A1 + 2500/P_A1rad) #@# !кВ
U_A2__rad = 1000 / sqrt(500/l_A2 + 2500/P_A2rad) #@# !кВ
"2.3. Вибір схем електричних з’єднань підстанцій та визначення кількісних показників мережі"#@#h !2
suml = l_A1 + l_12 + l_A2 #@# !км
sumP_H#@# !МВт
sumQ_H#@# !МВт
Q_КП#@# !Мвар
U_ном = 220 #@# !кВ

"ВИБІР СИЛОВИХ ТРАНСФОРМАТОРІВ"#@#h
"Потужність трансформаторів на двотрансформаторних підстанціях визначимо за формулою"#@#p
"$S_ТР >= S_нб over 1,4$"#@#p

o.output()
